app/views/subjects/index.html.erb

      <td class="center"><%= subject.visible ? 'Yes':'No'%></td>
      <td class="center"><%= subject.pages.size%></td>
---
SELECT COUNT(*) FROM "pages" WHERE "pages"."subject_id" = $1  [["subject_id", 5]]