app/views/subjects/show.html.erb

      <th>All Pages</th>
      <td><%= @subject.Page.find(20).permalink %></td>
---
SELECT "pages".* FROM "pages" WHERE "pages"."subject_id" = $1 AND "pages"."id" = $2 LIMIT $3  [["subject_id", 20], ["id", 20], ["LIMIT", 1]]