app/controllers/pages_controller.rb

  def index
    @pages=@subject.pages.all.sort
---
SELECT COUNT(*) FROM "pages"
SELECT "pages".* FROM "pages" WHERE "pages"."subject_id" = $1  [["subject_id", 29]]

  def create
    @page= Page.new(page_params)
    if @page.save
---
INSERT INTO "pages" ("subject_id", "name", "permalink", "position", "visible", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def edit
    @page = Page.find(params[:id])
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @page = Page.find(params[:id])

    if @page.update(page_params)
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "pages" SET "permalink" = $1, "updated_at" = $2 WHERE "pages"."id" = $3  [["permalink", "ghd"], ["updated_at", "2021-10-05 07:09:35.061781"], ["id", 4]]

  def delete
    @page = Page.find(params[:id])
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def destroy
    @page = Page.find(params[:id])
    @page.destroy
---
SELECT "pages".* FROM "pages" WHERE "pages"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "pages" WHERE "pages"."id" = $1  [["id", 6]]

  def find_subject
    @subject = Subject.find(params[:subject_id])
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]

  def set_page_count
    @page_count=Page.count
---
SELECT COUNT(*) FROM "pages"