app/controllers/sections_controller.rb

SELECT "sections".* FROM "sections"
---
  def index
    @sections = Section.all

SELECT COUNT(*) FROM "sections"
SELECT "pages".* FROM "pages"
---
  def new
    @section = Section.new
    @section_count=Section.count+1
    @pages=Page.all.sort

INSERT INTO "sections" ("page_id", "name", "position", "content_type", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["page_id", 3], ["name", "sd"], ["position", 2], ["content_type", "fs"], ["content", "fs"], ["created_at", "2021-10-04 14:21:05.202012"], ["updated_at", "2021-10-04 14:21:05.202012"]]
---
  def create
    @section= Section.new(section_params)
    if @section.save

SELECT "sections".* FROM "sections" WHERE "sections"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT COUNT(*) FROM "sections"
SELECT "pages".* FROM "pages"
---
  def edit
    @section = Section.find(params[:id])
    @section_count=Section.count
    @pages=Page.all.sort

SELECT "sections".* FROM "sections" WHERE "sections"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "sections" SET "page_id" = $1, "updated_at" = $2 WHERE "sections"."id" = $3  [["page_id", 5], ["updated_at", "2021-10-05 06:11:28.253003"], ["id", 1]]
---
  def update
    @section = Section.find(params[:id])

    if @section.update(section_params)

SELECT "sections".* FROM "sections" WHERE "sections"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def delete
    @section = Section.find(params[:id])

SELECT "sections".* FROM "sections" WHERE "sections"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "sections" WHERE "sections"."id" = $1  [["id", 2]]
---
  def destroy
    @section = Section.find(params[:id])
    @section.destroy