app/controllers/subjects_controller.rb

SELECT COUNT(*) FROM "subjects"
---
  def new
    @subject=Subject.new
    @subject_count=Subject.count+1

INSERT INTO "subjects" ("name", "position", "visible", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "fds"], ["position", 4], ["visible", true], ["created_at", "2021-10-06 09:32:23.503106"], ["updated_at", "2021-10-06 09:32:23.503106"]]
SELECT COUNT(*) FROM "subjects"
---
  def create
    @subject= Subject.new(subject_params)
    if @subject.save
      flash[:notice] ="Subject created successfully......"
      redirect_to("/subjects")
    else
      @subject_count=Subject.count+1

SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT COUNT(*) FROM "subjects"
---
  def edit
    @subject = Subject.find(params[:id])
    @subject_count=Subject.count

SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "subjects" SET "position" = $1, "updated_at" = $2 WHERE "subjects"."id" = $3  [["position", 4], ["updated_at", "2021-10-05 07:47:04.464657"], ["id", 21]]
SELECT COUNT(*) FROM "subjects"
---
  def update
    @subject = Subject.find(params[:id])

    if @subject.update(subject_params)
      flash[:notice] ="Subject Updated successfully......"
      redirect_to(subject_path(@subject)) #subjects_path
    else
      @subject_count=Subject.count

SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
---
  def delete
    @subject = Subject.find(params[:id])

SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT $2  [["id", 29], ["LIMIT", 1]]
DELETE FROM "subjects" WHERE "subjects"."id" = $1  [["id", 29]]
---
  def destroy
    @subject = Subject.find(params[:id])
    @subject.destroy