app/controllers/subjects_controller.rb

 def showAllPages
  @pages=Subject.last.pages
---
SELECT "subjects".* FROM "subjects" ORDER BY "subjects"."id" DESC LIMIT $1  [["LIMIT", 1]]

  def create
    @subject= Subject.new(subject_params)
    respond_to do |format|
      if @subject.save
---
INSERT INTO "subjects" ("name", "visible", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "DSA"], ["visible", true], ["created_at", "2021-12-06 10:06:00"], ["updated_at", "2021-12-06 10:06:36.897794"]]

  def update
    @subject = Subject.find(params[:id])

    if @subject.update(subject_params)
      flash[:notice] ="Subject Updated successfully......"
      redirect_to(subject_path(@subject)) #subjects_path
    else
      @subject_count=Subject.count
---
UPDATE "subjects" SET "name" = $1, "updated_at" = $2 WHERE "subjects"."id" = $3  [["name", "edit subject"], ["updated_at", "2021-12-10 10:47:06.819488"], ["id", 74]]
SELECT COUNT(*) FROM "subjects"

  def delete
    @subject = Subject.find(params[:id])
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def destroy
    @subject = Subject.find(params[:id])
    @subject.destroy
---
SELECT "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "subjects" WHERE "subjects"."id" = $1  [["id", 1]]